Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АкцизныйНалог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитическаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитическиеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безнадбавочный</Name>
					<Comment>На товар не распространяются никакие надбавки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безскидочный</Name>
					<Comment>На товар не распространяются ни какие скидки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСравнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Весовой товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаБлюда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыБлюд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заменяемый</Name>
					<Comment>Товар заменяется в чеке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКомплектами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяМодификаторами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУсловиями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЕдиницыИзмеренияДляОтчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоМодификаторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеВремяЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйВыборМодификаторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модифицируемый</Name>
					<Comment>Блюдо имеет неотъемлемый модификатор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>Набор товаров и блюд</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Краткое наименование, для ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Принтер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Печатаемый</Name>
					<Comment>Печать товара в пречеке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторениеМодификаторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Связана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС для данного товара</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Все виды услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточняемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИзображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ценовой</Name>
					<Comment>Товар имеющий цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штучный</Name>
					<Comment>Штучный товар</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/МодификаторыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>МодификаторыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МодификаторыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
					<Comment>Приготовленное блюдо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модификатор</Name>
					<Comment>Модификатор (ингредиент) блюда</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Меню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Меню</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыМеню</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Миниатюра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.__Изображения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура")) Тогда
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
			НоменклатурнаяГруппа = Родитель.НоменклатурнаяГруппа;
			КатегорияНоменклатуры = Родитель.КатегорияНоменклатуры;
			ГруппаБлюда = Родитель.ГруппаБлюда; //Костенюк Александр 10.08.2015
			
			ДанныеЗаполнения = НоменклатурнаяГруппа;
		КонецЕсли;
	КонецЕсли;
	
	Если (ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.НоменклатурныеГруппы")) Тогда
		Если Не ЭтоГруппа Тогда
			
			ТипНоменклатуры = ДанныеЗаполнения.ТипНоменклатуры;
			Если Не ЗначениеЗаполнено(ТипНоменклатуры) Тогда
				ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Блюдо;
			КонецЕсли; 
			БазоваяЕдиницаИзмерения = ДанныеЗаполнения.БазоваяЕдиницаИзмерения;
			Безнадбавочный = ДанныеЗаполнения.Безнадбавочный;
			Безскидочный = ДанныеЗаполнения.Безскидочный;
			СтавкаНДС = ДанныеЗаполнения.СтавкаНДС;
			АкцизныйНалог = ДанныеЗаполнения.АкцизныйНалог; //Костенюк Александр 04.02.2015
			ПенсионныйФонд = ДанныеЗаполнения.ПенсионныйФонд;
			НоменклатурнаяГруппа = ДанныеЗаполнения.Ссылка;
			ПродолжительностьПроизводства = ДанныеЗаполнения.ПродолжительностьПроизводства;
			
			Ценовой = УправлениеНоменклатуройКлиентСервер.ДоступностьЦенововго(ЭтотОбъект);
			
			Штучный = (Штучный Или УправлениеНоменклатуройКлиентСервер.ТолькоШтучный(ЭтотОбъект)) И УправлениеНоменклатуройКлиентСервер.ДоступностьШтучного(ЭтотОбъект);
			Весовой = Весовой И УправлениеНоменклатуройКлиентСервер.ДоступностьВесового(ЭтотОбъект);
			Временной = Временной И УправлениеНоменклатуройКлиентСервер.ДоступностьВременного(ЭтотОбъект);
			
			Печатаемый = Печатаемый И УправлениеНоменклатуройКлиентСервер.ДоступностьПечатаемого(ЭтотОбъект);
		
			Если Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
				Если (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар) Или 
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Или
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор) Или
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект) Или
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Сертификат) Или //Костенюк Александр 10.12.2014
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Депозит) Тогда
					БазоваяЕдиницаИзмерения = Константы.ЕдиницаИзмеренияШтучк.Получить();
				ИначеЕсли (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Блюдо) Или
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Модификатор) Или
					 (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Условие) Тогда
					БазоваяЕдиницаИзмерения = Константы.ЕдиницаИзмеренияПорций.Получить();
				КонецЕсли;
			КонецЕсли; 
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "НоменклатурнаяГруппа");
	Иначе
		Если Временной Тогда
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "ПродолжительностьПроизводства");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Версия.
	Если Не ЭтоГруппа Тогда	
		ВерсияСравнения = ВерсияДанных;
	КонецЕсли;
	
	// Нормализация.
	Если Не ЭтоГруппа Тогда
		Ценовой = Ценовой И УправлениеНоменклатуройКлиентСервер.ДоступностьЦенововго(ЭтотОбъект);
		
		//Модифицируемый = Модифицируемый И УправлениеНоменклатуройКлиентСервер.ДоступностьМодификаторов(ЭтотОбъект); 
		//Костенюк Александр-Старт 05.11.2012
		// Проверка на наличие модификаторов у модифицируемого товара
		ПравилаМодификаторовДерево = РегистрыСведений.МодификаторыНоменклатуры.ПолучитьСписокМодификаторов(ЭтотОбъект, ЭтотОбъект.Родитель, ЭтотОбъект);
		МассивАктуальных = ПравилаМодификаторовДерево.Строки.НайтиСтроки(Новый Структура("Актуальность", Истина), Истина);
		Модифицируемый = Модифицируемый И УправлениеНоменклатуройКлиентСервер.ДоступностьМодификаторов(ЭтотОбъект) И МассивАктуальных.Количество();
		//Костенюк Александр-Финиш 05.11.2012
		Если Не Модифицируемый Тогда
			МаксимальноеКоличествоМодификаторов = Неопределено;
		КонецЕсли; 
		МножественныйВыборМодификаторов = МножественныйВыборМодификаторов И Модифицируемый;
		ПовторениеМодификаторов = ПовторениеМодификаторов И МножественныйВыборМодификаторов;
												 
		Штучный = (Штучный Или УправлениеНоменклатуройКлиентСервер.ТолькоШтучный(ЭтотОбъект)) И УправлениеНоменклатуройКлиентСервер.ДоступностьШтучного(ЭтотОбъект);
		Весовой = Весовой И УправлениеНоменклатуройКлиентСервер.ДоступностьВесового(ЭтотОбъект);
		Временной = Временной И УправлениеНоменклатуройКлиентСервер.ДоступностьВременного(ЭтотОбъект);
		
		Печатаемый = Печатаемый И УправлениеНоменклатуройКлиентСервер.ДоступностьПечатаемого(ЭтотОбъект);
		
		Состав = УправлениеНоменклатуройКлиентСервер.ПривестиСостав(Состав);
		Выход = УправлениеНоменклатуройКлиентСервер.ПривестиВыход(Выход);
		
		Если Не Временной Тогда
			Оборудование = Неопределено;
			МинимальноеВремяЗаказа = Неопределено; //Костенюк Александр 29.09.2013
		КонецЕсли;
		
	КонецЕсли;
	
	// Параметры.
	Если Не ЭтоГруппа Тогда	
		Услуга = 
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
		Набор = 
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор);
		
		ИспользуетсяТоварами =  
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Блюдо) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Сертификат) Или //Костенюк Александр 10.12.2014
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Депозит);
		ИспользуетсяКомплектами = 	
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Блюдо) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор);
		ИспользуетсяМодификаторами = 
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Блюдо) Или
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Модификатор);
		ИспользуетсяУсловиями = 
			(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Условие);	
		КонецЕсли;
		
		
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый()); //Костенюк Александр 21.03.2014
		
		//Костенюк Александр-Старт 10.12.2015
		Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
			ЭтотОбъект.ГруппаБлюда = ЭтотОбъект.Родитель.ГруппаБлюда;
		КонецЕсли;
		//Костенюк Александр-Финиш 10.12.2015
		
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Перем ПараметрыЦены;
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Цена.
	Если ДополнительныеСвойства.Свойство("ПараметрыЦены", ПараметрыЦены) Тогда
		//.. Начало изменения Dim)on  7 октября 2013 г. 3:05:24
		//
		Если ПараметрыЦены.Свойство("ТаблицаЦенПоТипам") И ПараметрыЦены.ТаблицаЦенПоТипам.Количество() Тогда
			РегистрыСведений.ЦеныНоменклатуры.УстановитьЦеновыеПараметрыДляНесколькихТиповЦен(ЭтотОбъект, ПараметрыЦены.Период, Истина, Отказ, ПараметрыЦены.ТаблицаЦенПоТипам);
		Иначе
			РегистрыСведений.ЦеныНоменклатуры.ПриЗаписиНоменклатуры(ЭтотОбъект, ПараметрыЦены.Период, ПараметрыЦены.Цена, ПараметрыЦены.Себестоимость, Отказ);
		КонецЕсли;
		ДополнительныеСвойства.Удалить("ПараметрыЦены");
		//
		//.. Конец изменения Dim)on  7 октября 2013 г. 3:05:24
	КонецЕсли; 
	
	// Связанные данные.
	Если Не Отказ Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Меню.Ссылка
		                      |ИЗ
		                      |	Справочник.Меню КАК Меню
		                      |ГДЕ
		                      |	Меню.Номенклатура = &Номенклатура
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	МодификаторыНоменклатуры.Ссылка
		                      |ИЗ
		                      |	Справочник.МодификаторыНоменклатуры КАК МодификаторыНоменклатуры
		                      |ГДЕ
		                      |	МодификаторыНоменклатуры.Номенклатура = &Номенклатура
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	УсловияНоменклатуры.Ссылка
		                      |ИЗ
		                      |	Справочник.УсловияНоменклатуры КАК УсловияНоменклатуры
		                      |ГДЕ
		                      |	УсловияНоменклатуры.Номенклатура = &Номенклатура
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	КомплектыНоменклатуры.Ссылка
		                      |ИЗ
		                      |	Справочник.КомплектыНоменклатуры КАК КомплектыНоменклатуры
		                      |ГДЕ
		                      |	КомплектыНоменклатуры.Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СвязанныйОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СвязанныйОбъект.Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Наименование);
			СвязанныйОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				СвязанныйОбъект.Записать();
			Исключение
			    Отказ = Истина; // ERR
			КонецПопытки;
		КонецЦикла;
		
		////Костенюк Александр-Старт 21.03.2014
		//// При загрузке меню для новых позиций не нужно устанавливать флаги для типов скидок/наценок 
		//ЭтоНовый = Ложь;
		//ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый);
		//Если ЭтоНовый Тогда
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//				   |	ТипыСкидокНаценок.Ссылка КАК ТипСкидкиНаценки
		//				   |ИЗ
		//				   |	Справочник.ТипыСкидокНаценок КАК ТипыСкидокНаценок
		//				   |ГДЕ
		//				   |	НЕ ТипыСкидокНаценок.ПометкаУдаления
		//				   |	И НЕ ТипыСкидокНаценок.ЭтоГруппа";
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	НаборЗаписей = РегистрыСведений.СкидкиНаценкиНоменклатуры.СоздатьНаборЗаписей();
		//	НаборЗаписей.Отбор.Номенклатура.Установить(Ссылка);
		//	Пока Выборка.Следующий() Цикл
		//		Запись = НаборЗаписей.Добавить();
		//		Запись.Номенклатура = Ссылка;
		//		Запись.ТипСкидкиНаценки = Выборка.ТипСкидкиНаценки;
		//	КонецЦикла;
		//	Попытка
		//		НаборЗаписей.Записать(Истина);
		//	Исключение
		//		// ERR
		//		Сообщить(ОписаниеОшибки());
		//	КонецПопытки;
		//КонецЕсли;
		////Костенюк Александр-Финиш 21.03.2014
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 

КонецПроцедуры // ПриЗаписи()
